<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Sonic Pi, creates a package and uploads it to the jss.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.Will-L88.jss.sonicpi</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Developer Tools</string>
		<key>GROUP_NAME</key>
		<string>%NAME%</string>
		<key>GROUP_TEMPLATE1</key>
		<string>SmartGroupTemplate-install.xml</string>
		<key>GROUP_TEMPLATE2</key>
		<string>SmartGroupTemplate-update.xml</string>
		<key>NAME</key>
		<string>Sonic Pi</string>
		<key>POLICY_CATEGORY</key>
		<string>Developer Tools</string>
		<key>POLICY_TEMPLATE1</key>
		<string>PolicyTemplate-install.xml</string>
		<key>POLICY_TEMPLATE2</key>
		<string>PolicyTemplate-update.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Sonic Pi is a live coding environment based on Ruby, originally designed to support both computing and music lessons in schools, developed by Sam Aaron in the University of Cambridge Computer Laboratory in collaboration with Raspberry Pi Foundation.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Sonicpi.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.Will-L88.pkg.sonicpi</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE1%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE1%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE2%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE2%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>


	</array>
</dict>
</plist>
